//----------------------------------------------------
//数字をUIで使う文字列に変換する
//UIUtility.cs
//s.nakamura
//----------------------------------------------------

//どこでも使えるUtility
//Utilityクラスを使うときは、Utilityクラス.メソッド()
//Utilityクラスがどこでも使えるからって1つに全部入れるのはよくないぞ！？
//Utilityクラス1つにメソッドを1つだけでも良い
//Utilityクラスはどこからでも使えるんだぜ！？すげぇよな！？
//2つ以上同じ処理をしているクラスがあったらUtilityに置き換えた方が良い
//Utilityを1つのスプリクトででしか使わないならやめとけ
//中身を見られることは少ないのでコメントを書こうとのこと
//生成しなくていいんですって、無に挿入しなくていいんですって
//デバッグとかセーブ、ロードに使えるらしい、stringに変換するの便利そう、ダメージを表示するのとかに使われてるんかな

//コメントは書こう！！！！！(2)
//インスタンスを実体という意味らしい、敵クラスがあるならスライム、ドラキー別々にステータスがみたいなものな気がする
//コメントを書こう！！！！！！！（3回目）
//staticは静的という意味らしい、一番最初にそこに居た
//newしなくてもいい！？

public static class UIUtility
{
    /// <summary>
    /// ３桁ごとに「,」を挿入した文字列を生成する
    /// </summary>
    public static string NumberFormatter(int number)
    {
        return number.ToString("#,0");//#なので３桁ごとに,がつく
    }

    /// <summary>
    /// 数値をパーセント表示に変更
    /// </summary>
    public static string ConvertPercent(float ratio)
    {
        float convertRatio = ratio * 100.0f;//%表示させるために100掛ける
        return convertRatio.ToString("F2") + "%";//F2なので小数点２まで、F5にすれば小数点５まで表示する
    }
}